src/main/java/ok/dht/test/yasevich/profiling/stage6/wrk/v1/range100-rate7000
Running 30s test @ http://localhost:12353
  8 threads and 64 connections
  Thread calibration: mean lat.: 49.598ms, rate sampling interval: 256ms
  Thread calibration: mean lat.: 58.785ms, rate sampling interval: 361ms
  Thread calibration: mean lat.: 110.956ms, rate sampling interval: 708ms
  Thread calibration: mean lat.: 74.544ms, rate sampling interval: 507ms
  Thread calibration: mean lat.: 91.622ms, rate sampling interval: 633ms
  Thread calibration: mean lat.: 74.692ms, rate sampling interval: 482ms
  Thread calibration: mean lat.: 65.214ms, rate sampling interval: 409ms
  Thread calibration: mean lat.: 31.287ms, rate sampling interval: 205ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.06ms   81.59ms 693.25ms   91.67%
    Req/Sec   805.85     82.43     1.17k    73.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.11ms
 75.000%   24.69ms
 90.000%   95.94ms
 99.000%  452.10ms
 99.900%  619.01ms
 99.990%  675.84ms
 99.999%  688.64ms
100.000%  693.76ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.175     0.000000            1         1.00
       0.853     0.100000        12869         1.11
       1.215     0.200000        25739         1.25
       1.745     0.300000        38576         1.43
       2.879     0.400000        51426         1.67
       5.107     0.500000        64286         2.00
       6.791     0.550000        70706         2.22
       9.095     0.600000        77130         2.50
      12.271     0.650000        83569         2.86
      17.023     0.700000        89984         3.33
      24.687     0.750000        96416         4.00
      30.095     0.775000        99625         4.44
      36.863     0.800000       102842         5.00
      45.855     0.825000       106055         5.71
      57.887     0.850000       109277         6.67
      73.983     0.875000       112485         8.00
      83.583     0.887500       114087         8.89
      95.935     0.900000       115696        10.00
     110.783     0.912500       117305        11.43
     128.447     0.925000       118907        13.33
     151.295     0.937500       120519        16.00
     165.503     0.943750       121320        17.78
     184.063     0.950000       122122        20.00
     207.743     0.956250       122927        22.86
     237.439     0.962500       123729        26.67
     273.919     0.968750       124538        32.00
     293.119     0.971875       124940        35.56
     313.087     0.975000       125337        40.00
     333.823     0.978125       125741        45.71
     361.471     0.981250       126141        53.33
     395.007     0.984375       126540        64.00
     407.551     0.985938       126742        71.11
     422.655     0.987500       126944        80.00
     439.807     0.989062       127143        91.43
     459.775     0.990625       127343       106.67
     477.951     0.992188       127549       128.00
     487.423     0.992969       127647       142.22
     497.663     0.993750       127745       160.00
     511.743     0.994531       127847       182.86
     525.823     0.995313       127950       213.33
     540.159     0.996094       128046       256.00
     548.863     0.996484       128098       284.44
     556.543     0.996875       128148       320.00
     565.247     0.997266       128200       365.71
     573.439     0.997656       128248       426.67
     584.703     0.998047       128298       512.00
     590.847     0.998242       128324       568.89
     596.991     0.998437       128350       640.00
     604.159     0.998633       128373       731.43
     612.351     0.998828       128398       853.33
     620.031     0.999023       128424      1024.00
     625.151     0.999121       128437      1137.78
     630.271     0.999219       128449      1280.00
     634.367     0.999316       128462      1462.86
     639.999     0.999414       128473      1706.67
     648.703     0.999512       128486      2048.00
     652.799     0.999561       128495      2275.56
     654.335     0.999609       128498      2560.00
     659.455     0.999658       128505      2925.71
     662.527     0.999707       128511      3413.33
     665.087     0.999756       128518      4096.00
     666.111     0.999780       128522      4551.11
     666.623     0.999805       128523      5120.00
     670.207     0.999829       128527      5851.43
     671.231     0.999854       128530      6826.67
     672.255     0.999878       128533      8192.00
     673.279     0.999890       128534      9102.22
     676.863     0.999902       128537     10240.00
     677.887     0.999915       128538     11702.86
     678.911     0.999927       128539     13653.33
     679.935     0.999939       128541     16384.00
     679.935     0.999945       128541     18204.44
     681.983     0.999951       128542     20480.00
     682.495     0.999957       128543     23405.71
     683.519     0.999963       128545     27306.67
     683.519     0.999969       128545     32768.00
     683.519     0.999973       128545     36408.89
     683.519     0.999976       128545     40960.00
     684.543     0.999979       128546     46811.43
     684.543     0.999982       128546     54613.33
     688.639     0.999985       128547     65536.00
     688.639     0.999986       128547     72817.78
     688.639     0.999988       128547     81920.00
     688.639     0.999989       128547     93622.86
     688.639     0.999991       128547    109226.67
     693.759     0.999992       128548    131072.00
     693.759     1.000000       128548          inf
#[Mean    =       35.058, StdDeviation   =       81.587]
#[Max     =      693.248, Total count    =       128548]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  197946 requests in 30.00s, 664.97MB read
  Socket errors: connect 0, read 0, write 0, timeout 40
Requests/sec:   6598.08
Transfer/sec:     22.17MB